# Series

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
ser1 = pd.Series([1,2,3,4],index = ['USA','Germany','Italy','Japan'])
ser1

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [10]:
ser2 = pd.Series([1,2,5,4],index = ['USA','Germany','USSR','Japan'])
ser2

USA        1
Germany    2
USSR       5
Japan      4
dtype: int64

In [11]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

In [12]:
from numpy.random import randn
np.random.seed(101)

In [13]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [14]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [21]:
df['new'] = df['X']+df['Y']

In [22]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [25]:
df.drop('new',axis = 1,inplace = True)

In [31]:
#rows
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

# conditional selection

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [34]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
# select the W,Z which X<0
df[df['X']<0][['W','Z']]

          W         Z
B  0.651118  0.605965
D  0.188695  0.955057

In [51]:
#select the x,w when y<0 z>0
# and 只能对比单一的bool，例如 T and T == T， 这个题是series of bool，用&
df[(df['Y']<0) & (df['Z']>0)][['X','W']]

          X         W
B -0.319318  0.651118
D -0.758872  0.188695

# index

In [63]:
df.reset_index()

  state         W         X         Y         Z
0    CA  2.706850  0.628133  0.907969  0.503826
1    NY  0.651118 -0.319318 -0.848077  0.605965
2    WY -2.018168  0.740122  0.528813 -0.589001
3    OR  0.188695 -0.758872 -0.933237  0.955057
4    CO  0.190794  1.978757  2.605967  0.683509

In [64]:
newind = 'CA NY WY OR CO'.split()

In [65]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [66]:
df['state'] = newind

In [67]:
df

              W         X         Y         Z state
state
CA     2.706850  0.628133  0.907969  0.503826    CA
NY     0.651118 -0.319318 -0.848077  0.605965    NY
WY    -2.018168  0.740122  0.528813 -0.589001    WY
OR     0.188695 -0.758872 -0.933237  0.955057    OR
CO     0.190794  1.978757  2.605967  0.683509    CO

In [68]:
df.set_index('state',inplace=True)

In [69]:
df

              W         X         Y         Z
state
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

# Multi-index and index hierarchy

In [72]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [73]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [74]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [75]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [77]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [78]:
df.index.names = ['Group','Num']

In [79]:
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [81]:
#cross section, can grab the data inside, no need to grab layer by layer
df.xs(1,level='Num')

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502